var geocoder;
var marker;

var cities = [
"47 км (Московская область)",
"Абрамцево (Московская область)",
"Авдотьино (Московская область)",
"Акатово (Московская область)",
"Алмазово (Московская область)",
"Апрелевка (Московская область)",
"Апсарёвское урочище (Московская область)",
"Архангельское (Московская область)",
"Афанасово (Московская область)",
"Балашиха (Московская область)",
"Барвиха (Московская область)",
"Бахчиванджи (Московская область)",
"Белоомут (Московская область)",
"Белый Раст (Московская область)",
"Боблово (Московская область)",
"Богородское (Московская область)",
"Большие Белыничи (Московская область)",
"Большие Всегодичи (Владимирская область)",
"Большие Вязёмы (Московская область)",
"Борисово (Московская область)",
"Бородино (Московская область)",
"Бортнево (Московская область)",
"Бронницы (Московская область)",
"Валищево (Московская область)",
"Валуево (Московская область)",
"Васильевское (Московская область)",
"Васино (Московская область)",
"Вербилки (Московская область)",
"Верея (Московская область)",
"Верзилово (Московская область)",
"Вертково (Московская область)",
"Верхнее Мячково (Московская область)",
"Видное (Московская область)",
"Виноградово (Московская область)",
"Володкино (Московская область)",
"Волоколамск (Московская область)",
"Волынщино (Московская область)",
"Вороново (Московская область)",
"Воскресенск (Московская область)",
"Высоковск (Московская область)",
"Газопровод (Московская область)",
"Гжель (Московская область)",
"Глебово (Московская область)",
"Гололобово (Московская область)",
"Горки Ленинские (Московская область)",
"Горы (Московская область)",
"Грибаново (Московская область)",
"Данилово (Московская область)",
"Данки (Московская область)",
"Дарна (Московская область)",
"Даровое (Московская область)",
"Деденево (Московская область)",
"Дедовск (Московская область)",
"Десна-Буревестник (Московская область)",
"Дзержинский (Московская область)",
"Дмитров (Московская область)",
"Дмитровский Погост (Московская область)",
"Долгопрудный (Московская область)",
"Домодедово (Московская область)",
"Дракино (Московская область)",
"Дрезна (Московская область)",
"Дровнино (Московская область)",
"Дрожжино (Московская область)",
"Дубна (Московская область)",
"Дубосеково (Московская область)",
"Дунино (Московская область)",
"Душоново (Московская область)",
"Егорьевск (Московская область)",
"Елино (Московская область)",
"Ефимьево (Московская область)",
"Железнодорожный (Московская область)",
"Жестылево (Московская область)",
"Жостово (Московская область)",
"Жуковский (Московская область)",
"Зарайск (Московская область)",
"Заря (Московская область)",
"Захарово (Московская область)",
"Звездный городок (Московская область)",
"Звенигород (Московская область)",
"Зеленоград (Московская область)",
"Ивановская (Московская область)",
"Ивантеевка (Московская область)",
"Икша (Московская область)",
"Ильинский погост (Московская область)",
"Ильинское (Московская область)",
"Истра (Московская область)",
"Каменское (Московская область)",
"Карпово (Московская область)",
"Кашира (Московская область)",
"Климовск (Московская область)",
"Клин (Московская область)",
"Коломна (Московская область)",
"Колоцкое (Московская область)",
"Комягино (Московская область)",
"Королев (Московская область)",
"Королёв (Московская область)",
"Костыши (Московская область)",
"Коськово (Московская область)",
"Котельники (Московская область)",
"Красноармейск (Московская область)",
"Красновидово (Московская область)",
"Красногорск (Московская область)",
"Красное (Орехово-Зуевский р-н) (Московская область)",
"Краснозаводск (Московская область)",
"Краснознаменск (Московская область)",
"Кривандино (Московская область)",
"Кубинка-1 (Московская область)",
"Кузнецово (Московская область)",
"Кузнецы (Московская область)",
"Кузьменки (Московская область)",
"Кузьминское (Московская область)",
"Куровское (Московская область)",
"Ливадия (Московская область)",
"Ликино-Дулево (Московская область)",
"Лобня (Московская область)",
"Лосино-Петровский (Московская область)",
"Лужки (Московская область)",
"Лукино (Московская область)",
"Луховицы (Московская область)",
"Лызлово (Московская область)",
"Лыткарино (Московская область)",
"Любаново (Московская область)",
"Люберцы (Московская область)",
"Ляхово (Московская область)",
"Малая Дубна (Московская область)",
"Малетино (Архангельская область)",
"Малинники (Московская область)",
"Марфино (Московская область)",
"Марьинка (Московская область)",
"Матвейково (Московская область)",
"Мелихово (Московская область)",
"Микулино Городище (Московская область)",
"Михайловская слобода (Московская область)",
"Можайск (Московская область)",
"Монино (Московская область)",
"Мураново (Московская область)",
"Мытищи (Московская область)",
"Навошино (Московская область)",
"Надовражино (Московская область)",
"Наро-Фоминск (Московская область)",
"Непецино (Московская область)",
"Николо-Урюпино (Московская область)",
"Никольское (Рузский р-н) (Московская область)",
"Новая (Московская область)",
"Новоселки (Чеховский район) (Московская область)",
"Новотроицкое (Московская область)",
"Новохаритоново (Московская область)",
"Новый Быт (Московская область)",
"Ногинск (Московская область)",
"Одинцово (Московская область)",
"Ожерелки (Московская область)",
"Ожерелье (Московская область)",
"Озеры (Московская область)",
"Озёры (Московская область)",
"Ольгово (Московская область)",
"Орехово-Зуево (Московская область)",
"Осеченки (Московская область)",
"Осташево (Московская область)",
"Осташков (Тверская область)",
"Остров (Московская область)",
"Павловская слобода (Московская область)",
"Павловский Посад (Московская область)",
"Первомайский (Московская область)",
"Переделкино (Московская область)",
"Пересвет (Московская область)",
"Перхурово (77 км М2) (Московская область)",
"Пески (Московская область)",
"Петрово-Дальнее (Московская область)",
"Петровское (Московская область)",
"Пешково (Московская область)",
"Подмоклово (Московская область)",
"Подольск (Московская область)",
"Подъячево (Московская область)",
"Поярково (Московская область)",
"Пролетарский (Московская область)",
"Протасово (Московская область)",
"Протвино (Московская область)",
"Пушкино (Московская область)",
"Пущино (Московская область)",
"Радонеж (Московская область)",
"Райсеменовское (Московская область)",
"Раково (Московская область)",
"Раменское (Московская область)",
"Реутов (Московская область)",
"Рогачево (Московская область)",
"Родионцево (Московская область)",
"Рождественно (Московская область)",
"Рошаль (Московская область)",
"Руза (Московская область)",
"Рязановский (Московская область)",
"Салтыковка (Московская область)",
"Семеновское (Московская область)",
"Сергиев Посад (Московская область)",
"Середниково (Московская область)",
"Серпухов (Московская область)",
"Снегири (Московская область)",
"Солнечногорск (Московская область)",
"Спас-Заулок (Московская область)",
"Спасс-Косицы (Московская область)",
"Старый Покров (Московская область)",
"Степановка (Московская область)",
"Ступино (Московская область)",
"Сходня (Московская область)",
"Талдом (Московская область)",
"Талеж (Московская область)",
"Талицы (Московская область)",
"Тараканово (Московская область)",
"Тарасково (Московская область)",
"Таширово (Московская область)",
"Теряево (Московская область)",
"Трехселище (Московская область)",
"Троицк (Московская область)",
"Уборы (Московская область)",
"Удельная (Московская область)",
"Удино (Московская область)",
"Федоровка (Московская область)",
"Федоскино (Московская область)",
"Фруктовая (Московская область)",
"Фрязино (Московская область)",
"Фряново (Московская область)",
"Химки (Московская область)",
"Хотьково (Московская область)",
"Чашниково (Московская область)",
"Черноголовка (Московская область)",
"Чехов (Московская область)",
"Чиркино (Московская область)",
"Шапкино (Московская область)",
"Шатура (Московская область)",
"Шаховская (Московская область)",
"Шишкин Лес (Московская область)",
"Шолохово (Московская область)",
"Щелково (Московская область)",
"Щёлково (Московская область)",
"Щелыково (Костромская область)",
"Щербинка (Московская область)",
"Электрогорск (Московская область)",
"Электросталь (Московская область)",
"Электроугли (Московская область)",
"Юбилейный (Московская область)",
"Юность (Московская область)",
"Ям (Московская область)",
"Ямкино (Московская область)",
"Ярополец (Московская область)",
"Яхрома (Московская область)",
"Москва",
];

var mkad_km =  [
[1,37.842762,55.774558],
[2,37.842789,55.76522],
[3,37.842627,55.755723],
[4,37.841828,55.747399],
[5,37.841217,55.739103],
[6,37.840175,55.730482],
[7,37.83916,55.721939],
[8,37.837121,55.712203],
[9,37.83262,55.703048],
[10,37.829512,55.694287],
[11,37.831353,55.68529],
[12,37.834605,55.675945],
[13,37.837597,55.667752],
[14,37.839348,55.658667],
[15,37.833842,55.650053],
[16,37.824787,55.643713],
[17,37.814564,55.637347],
[18,37.802473,55.62913],
[19,37.794235,55.623758],
[20,37.781928,55.617713],
[21,37.771139,55.611755],
[22,37.758725,55.604956],
[23,37.747945,55.599677],
[24,37.734785,55.594143],
[25,37.723062,55.589234],
[26,37.709425,55.583983],
[27,37.696256,55.578834],
[28,37.683167,55.574019],
[29,37.668911,55.571999],
[30,37.647765,55.573093],
[31,37.633419,55.573928],
[32,37.616719,55.574732],
[33,37.60107,55.575816],
[34,37.586536,55.5778],
[35,37.571938,55.581271],
[36,37.555732,55.585143],
[37,37.545132,55.587509],
[38,37.526366,55.5922],
[39,37.516108,55.594728],
[40,37.502274,55.60249],
[41,37.49391,55.609685],
[42,37.484846,55.617424],
[43,37.474668,55.625801],
[44,37.469925,55.630207],
[45,37.456864,55.641041],
[46,37.448195,55.648794],
[47,37.441125,55.654675],
[48,37.434424,55.660424],
[49,37.42598,55.670701],
[50,37.418712,55.67994],
[51,37.414868,55.686873],
[52,37.407528,55.695697],
[53,37.397952,55.702805],
[54,37.388969,55.709657],
[55,37.383283,55.718273],
[56,37.378369,55.728581],
[57,37.374991,55.735201],
[58,37.370248,55.744789],
[59,37.369188,55.75435],
[60,37.369053,55.762936],
[61,37.369619,55.771444],
[62,37.369853,55.779722],
[63,37.372943,55.789542],
[64,37.379824,55.79723],
[65,37.386876,55.805796],
[66,37.390397,55.814629],
[67,37.393236,55.823606],
[68,37.395275,55.83251],
[69,37.394709,55.840376],
[70,37.393056,55.850141],
[71,37.397314,55.858801],
[72,37.405588,55.867051],
[73,37.416601,55.872703],
[74,37.429429,55.877041],
[75,37.443596,55.881091],
[76,37.459065,55.882828],
[77,37.473096,55.884625],
[78,37.48861,55.888897],
[79,37.5016,55.894232],
[80,37.513206,55.899578],
[81,37.527597,55.90526],
[82,37.543443,55.907687],
[83,37.559577,55.909388],
[84,37.575531,55.910907],
[85,37.590344,55.909257],
[86,37.604637,55.905472],
[87,37.619603,55.901637],
[88,37.635961,55.898533],
[89,37.647648,55.896973],
[90,37.667878,55.895449],
[91,37.681721,55.894868],
[92,37.698807,55.893884],
[93,37.712363,55.889094],
[94,37.723636,55.883555],
[95,37.735791,55.877501],
[96,37.741261,55.874698],
[97,37.764519,55.862464],
[98,37.765992,55.861979],
[99,37.788216,55.850257],
[100,37.788522,55.850383],
[101,37.800586,55.844167],
[102,37.822819,55.832707],
[103,37.829754,55.828789],
[104,37.837148,55.821072],
[105,37.838926,55.811599],
[106,37.840004,55.802781],
[107,37.840965,55.793991],
[108,37.841576,55.785017]
];

var map = null;
var polygon = null;
var myCollection = null;
var oldRoute = null;
var oldPoint = null;
 
function mapInitialize()
{
  map = new ymaps.Map('YMapsID', {center: [55.74954, 37.621587], zoom: 11});
  map.controls
        .add('typeSelector')
        .add('smallZoomControl')
        .add('mapTools');
        
  myCollection = new ymaps.GeoObjectCollection();

    var coords = [];
    
    // Создаем полигон МКАД по заданным координатам mkad_km
    for(i = 0; i < 108; i++) {
        coords.push([ mkad_km[i][2], mkad_km[i][1] ]);
    }
    //alert(coords[107][0]);
    polygon = new ymaps.Polygon([coords], {balloonContent: "МКАД"},
        {
            fill: false,
            balloonCloseButton: false,
            strokeColor: "0000FF55",
            strokeWidth: 5
        }
    );
    
    myCollection.add(polygon);
    map.geoObjects.add(myCollection);
}
 
jQuery(document).ready(jQuery(function($) {
  //jQuery.noConflict();
  
  //$("#city").focus();
 
    ymaps.ready(mapInitialize);

        /*geocoder.geocode( {'city': request.term}, function(results, status) {
          response($.map(results, function(item) {
            return {
              label:  item.formatted_address,
              value: item.formatted_address,
              latitude: item.geometry.location.lat(),
              longitude: item.geometry.location.lng()
            }
          }));
        })*/
        
        /*geocoder.geocode( {'city': request.term}, function(results, status) {
          response($.map(results, function(item) {
            return {
              label:  item.formatted_address,
              value: item.formatted_address,
              latitude: item.geometry.location.lat(),
              longitude: item.geometry.location.lng()
            }
          }));
        });*/
        
  $("#city").click(function () {
    $('.ui-autocomplete-input').first()
        .focus()
        .val('')
        .autocomplete('close');
    return false;
});

    $("#city").select();
   
  jQuery(function($) {
    //alert($().jquery);
    $("#city").autocomplete({
        autoFocus: true,
        source: function(request, response) {
          
        var count = 0;
        var arr = [];
        jQuery.each(cities, function (index, value) {
            if (typeof value == 'undefined')
                return;
            if (value.toLowerCase().indexOf(request.term.toLowerCase()) === 0)
            {
                arr.push({
                    label: value,
                    value: value
                });
                if (count++ >= 10)
                    return false;
            }
        });//);
        if (count++ >= 10)
            arr.push({
                    label: "...",
                    value: ""
                });
        response(arr);
          
          /*$.ajax({
            url: 'http://geocode-maps.yandex.ru/1.x/',
            dataType: 'jsonp',
            data: {
                results: 3,
                geocode: request.term,
                format: 'json'
            },
            success: function(data){
                //alert(typeof(data.response.GeoObjectCollection.metaDataProperty));
                var arr = [];
                alert(data.response.GeoObjectCollection.featureMember.length);
                jQuery.each(data.response.GeoObjectCollection.featureMember, function (index, value) {
                    alert(value.GeoObject.metaDataProperty.GeocoderMetaData.kind);
                    //alert(index);
                    //alert(item.metaDataProperty.)
                    arr.push({
                        label: value.GeoObject.name,
                        value: 0
                    });
                });//);
                //alert(arr);
                response(arr);
            }
        });*/
      },
      //Выполняется при выборе конкретного адреса
      select: function(event, ui) {
          $("#city").select();
          $('#distance').val('');

          var city = ui.item.label;
          var cityS = city;
		  $('.h_distance').val(city);


          city = city.replace(/(.+)\s\((.+)\)\s\((.+)\)/g, 'Россия, $3, $2, $1');
          city = city.replace(/(.+)\s\((.+)\)/g, 'Россия, $2, $1');
          //city = city.replace(/\)/g, '');
          //alert(city);
          
          /*$.ajax({
            url: 'http://geocode-maps.yandex.ru/1.x/',
            dataType: 'jsonp',
            data: {
                results: 10,
                geocode: city,
                format: 'json'
            },
            success: function(data){
                //alert(typeof(data.response.GeoObjectCollection.metaDataProperty));
                var arr = [];
                alert(data.response.GeoObjectCollection.featureMember.length);
                jQuery.each(data.response.GeoObjectCollection.featureMember, function (index, value) {
                    if (value.GeoObject.metaDataProperty.GeocoderMetaData.kind != 'locality' ||
                        value.GeoObject.metaDataProperty.GeocoderMetaData.AddressDetails.Country.CountryName != 'Россия')
                        return true;
                    //alert(value.GeoObject.metaDataProperty.GeocoderMetaData.kind);
                    //alert(index);
                    //alert(item.metaDataProperty.)
                    arr.push({
                        label: value.GeoObject.name,
                        value: 0
                    });
                    $('#distance').val(value.GeoObject.name);
                });//);
                alert(arr.length);
                //response(arr);
            }
          });*/
          
             if (oldPoint != null)
                myCollection.remove(oldPoint);
             if (oldRoute != null)
                myCollection.remove(oldRoute);
                
             //$('#distance').val(0);
            var geocoder = new ymaps.geocode(city, {results: 1});
            geocoder.then(
                function (res) {
                   if (res.geoObjects.getLength())
                   {
                        var point = res.geoObjects.get(0);
                   
                        //point.properties.set('iconContent', 'xxx');
                        point.options.hideIconOnBalloonOpen = true;
                        point.properties.set('balloonContentHeader', city);
                        point.properties.set('balloonContentHeader', '<b>' + point.properties.get('balloonContentHeader') + '</b>');
                        map.panTo(point.geometry.getCoordinates());
                       
                        if(polygon.geometry.contains(point.geometry.getCoordinates())) {
                        	//Москва
                            //$('#distance').val(0);
                            $.ajax({
					            data:"ajax=getDeliverySum",
					            success:function(json){
					            	var delivsum = parseInt(json.moscow);
					            	$('.delivSum').val(delivsum);
                      	$('.text_4').html(delivsum+' руб.');
                      	getCart();
					            }
					        });
                        } else {
                            //var newTarget = polygon.geometry.getClosest(point.geometry.getCoordinates()).position;
                            var from_km_index = polygon.geometry.getClosest(point.geometry.getCoordinates()).closestPointIndex;
                            //alert(from_km_index);
                            //$('#distance').val(from_km_index);
                            ymaps.route([mkad_km[from_km_index][0] + 'км МКАД', { type: 'wayPoint', point: point.geometry.getCoordinates()}],
                                {mapStateAutoApply: true}).then(function (route) {
                                     route.getPaths().options.set({
                                         // в балуне выводим только информацию о времени движения с учетом пробок
                                         balloonContenBodyLayout: ymaps.templateLayoutFactory.createClass('$[properties.humanJamsTime]'),
                                         // можно выставить настройки графики маршруту
                                         strokeColor: '0000ffff',
                                         opacity: 0.9
                                     });
                                        
                                     myCollection.add(point);
                                     oldPoint = point;
                                     //point.balloon.open(point.geometry.getCoordinates());
                                     
                                     // добавляем маршрут на карту
                                     myCollection.add(route);
                                     oldRoute = route;
                                     var dis = Math.ceil(route.getLength()/1000);

                                     $.ajax({
							            data:"ajax=getDeliverySum",
							            success:function(json){
							            	var delivsum = parseInt(json.moscow)+dis*parseInt(json.km);
							            	$('.delivSum').val(delivsum);
			                            	$('.text_4').html(delivsum+' руб. <span>'+json.moscow+' руб. + '+dis+' км. x '+json.km+' руб.</span>');
			                            	getCart();
							            }
					      			});

							         var distance = '≈ '+dis+' км.';
									 $('#distance').val(distance);
                                     $("#city").select();
                                 });
                        }
                        //map.setBounds(res.getBounds());
                  }
                  else
                    alert('Адрес не найден!')
                },
                function (error) {
                    alert('Произошла ошибка: ' + error);
                }
            );
            
            /*YMaps.Events.observe(geocoder, geocoder.Events.Load, function (geocoder) {
                if (geocoder.length()) { // Если адрес определен
                    var point = geocoder.get(0).getGeoPoint();

                } else {

                    alert('Адрес не удалось определить');

                }
            });            */
          //alert(ui.item.label);
        //$("#latitude").val(ui.item.latitude);
        //$("#longitude").val(ui.item.longitude);
      }
    });
  });
  
}));